Управление_торговлей.ПБТ/src/Documents/ТребованияККачествуЗакупаемогоТовара/ТребованияККачествуЗакупаемогоТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТребованияККачествуЗакупаемогоТовара</name>
  <registerRecords>InformationRegister.НормативыНоменклатурыЛаб</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСырья</name>
    <type>
      <types>CatalogRef.ВидыСырья</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состав</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставАнгл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеДляВидаСырья</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОКК</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОККЗаАнализРазногласий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаЦИРПоРазногласиямЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаОККПоРазногласиямЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АллергеныЗаполнены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормированияТребований</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Актуально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаАнглийском</name>
    <comment>(Общ) Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеНеобходимо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РН</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураПоставщика</name>
    <type>
      <types>CatalogRef.НоменклатураКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>История</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РаботаЦПБЗавершена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РаботаОККЗавершена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПищеваяЦенность</name>
    <attributes>
      <name>Ценность</name>
      <type>
        <types>CatalogRef.ПищевыеЦенности</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехническиеРегламенты</name>
    <attributes>
      <name>ПродуктУпаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>Регламент</name>
      <type>
        <types>CatalogRef.ТехническиеРегламенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>МетодИсследования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателяОтНасНачальные</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантСравнения</name>
      <type>
        <types>EnumRef.ВариантыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Интервал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.ПериодичностьЛаб</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лаборатория</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>Любая дополнительная информация</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтНасАнглийский</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателяАнглийский</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеВыводитьВСпецификации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателяОтПоставщикаНачальные</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателяКонечные</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КтоВнес</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КогдаВнес</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтличаетсяОтТР_ТС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьСторонняя</name>
      <type>
        <types>EnumRef.ПериодичностьЛаб</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНорматива</name>
      <type>
        <types>CatalogRef.ХарактеристикиНормативов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Enums/СтатусЗаявки/СтатусЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗаявки</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ОРПоказателиКачества</name>
  </enumValues>
  <enumValues>
    <name>ТребованияСформированы</name>
  </enumValues>
  <enumValues>
    <name>ОККПоказателиБезопасности</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>Разногласия</name>
  </enumValues>
  <enumValues>
    <name>ОтказСотрудничатьСПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>АнализОКК</name>
  </enumValues>
  <enumValues>
    <name>ПоставщикуНаПодпись</name>
  </enumValues>
  <enumValues>
    <name>ГДНаПодпись</name>
  </enumValues>
  <enumValues>
    <name>Периодичность</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей.ПБТ/src/Documents/ТребованияККачествуЗакупаемогоТовара/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПечатьРазногласий(Команда)
	ТабДок = ПечатьРазногласийНаСервере();
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Функция ПечатьРазногласийНаСервере()
	Возврат Документы.ТребованияККачествуЗакупаемогоТовара.ПечатьРусский(Объект, Истина);
КонецФункции

&НаСервере
Функция ПриложениеНаСервере()
	Возврат Документы.ТребованияККачествуЗакупаемогоТовара.ПечатьПриложения(Объект);
КонецФункции

&НаКлиенте
Процедура Приложение(Команда)
	ТабДок = ПриложениеНаСервере();
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Первоначальное заполнение объекта.
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.Статус = Перечисления.СтатусЗаявки.Новый; 
		
		Объект.Актуально = Истина; 
		Объект.ОтветственныйОКК = Справочники.Пользователи.НайтиПоКоду("Богатова Галина");//0018162
		Объект.История.Очистить(); 
		
		Объект.Инициатор = Пользователи.ТекущийПользователь(); 
		
		//ЗаполнитьПервоначальныеЗначения();
		//Форма.ПриПолученииДанныхНаСервере(Форма.РеквизитФормыВЗначение("Объект"));
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов() Экспорт
	
	Если РольДоступна("Требования_ПолныеПрава") Или РольДоступна("ЦИР") Тогда
		Элементы.Показатели.Колонки.Периодичность.Доступность = Истина;
		Элементы.РаботаЦИРПоРазногласиямЗавершена.Доступность = Истина;
	Иначе
		Элементы.РаботаЦИРПоРазногласиямЗавершена.Доступность = Ложь;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("РаботаОККПоРазногласиямЗавершена");
	МассивЭлементов.Добавить("Актуально");
	
	Если РольДоступна("Требования_ПолныеПрава") Тогда
		ДоступныПолныеПрава = Истина;
	Иначе
		ДоступныПолныеПрава = ЛОжь;
	КонецЕсли;
	
	//ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, МассивЭлементов, "Доступность", ДоступныПолныеПрава);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементов, "Доступность", ДоступныПолныеПрава);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура АллергеныПередОкончаниемРедактированияНаСервере(Данные)
	
	Данные.Ответственный = Пользователи.ТекущийПользователь();
	Данные.ДатаДобавления = ТекущаяДатаСеанса();
	
КонецПроцедуры

&НаКлиенте
Процедура АллергеныПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	АллергеныПередОкончаниемРедактированияНаСервере(Элементы.Аллергены.ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаАнглийскомНаСервере()
	
	Для каждого Стр Из Объект.Показатели Цикл
		Если ЗначениеЗаполнено(Стр.ЗначениеПоказателяКонечные) Тогда
			Стр.ЗначениеПоказателяАнглийский = Переводы.ПеревестиЯндексом(Стр.ЗначениеПоказателяКонечные);
		Иначе
			Стр.ЗначениеПоказателяАнглийский = Переводы.ПеревестиЯндексом(Стр.ЗначениеПоказателяОтНасНачальные);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Стр.ТЧ_ПоказателиОтНасАнглийский) Тогда
	    Стр.ЗначениеПоказателяАнглийский = Переводы.ПеревестиЯндексом(Стр.ЗначениеПоказателяОтНасНачальные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаАнглийском(Команда)
	ЗаполнитьНаАнглийскомНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТЧ_ПоказателиПоказательПриИзмененииНаСервере(Идент)
	
	Данные = Объект.Показатели.НайтиПоИдентификатору(Идент);
	
	Если ЗначениеЗаполнено(Данные.Показатель) Тогда
		Данные.ВидИсследования = Данные.Показатель.ВидИсследования;
		Данные.ЕдиницаИзмерения = Данные.Показатель.ЕдиницаИзмерения;
		
		Если Данные.Показатель.ТипЗначения = 0 Тогда
			Данные.ЗначениеПоказателяОтНасНачальные = 0;
			Данные.ЗначениеПоказателяОтНасНачальные = 0;
			Данные.ЗначениеПоказателяОтПоставщикаНачальные = 0;
			Данные.ЗначениеПоказателяКонечные = 0;
		Иначе	
			Данные.ЗначениеПоказателяОтНасНачальные = "";
			Данные.ЗначениеПоказателяОтНасНачальные = "";
			Данные.ЗначениеПоказателяОтПоставщикаНачальные = "";
			Данные.ЗначениеПоказателяКонечные = "";
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ПоказателиПоказательПриИзменении(Элемент)
	
	ТекСтр = Элементы.Показатели.ТекущаяСтрока;
	//ТекСтр = ДанныеФормыВЗначение(, Тип("СтрокаТабличнойЧасти"))
	//ТекСтр = Объект.Показатели.НайтиПоИдентификатору(Элементы.Показатели.ТекущаяСтрока);
	ТЧ_ПоказателиПоказательПриИзмененииНаСервере(ТекСтр);
	
КонецПроцедуры

&НаСервере
Процедура ТЧ_ПоказателиЗначениеПоказателяОтНасНачальныеПриИзмененииНаСервере(Идент)
	
	Стр = Объект.Показатели.НайтиПоИдентификатору(Идент);
	Стр.ЗначениеПоказателяКонечные = Стр.ЗначениеПоказателяОтНасНачальные;
	Стр.ЗначениеПоказателяОтПоставщикаНачальные = Стр.ЗначениеПоказателяОтНасНачальные;
	Стр.ЗначениеПоказателяАнглийский = Переводы.ПеревестиЯндексом(Стр.ЗначениеПоказателяКонечные);
	Стр.ОтНасАнглийский = Переводы.ПеревестиЯндексом(Стр.ЗначениеПоказателяОтНасНачальные);	

КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ПоказателиЗначениеПоказателяОтНасНачальныеПриИзменении(Элемент)
	
	ТекСтр = Элементы.Показатели.ТекущаяСтрока;
	ТЧ_ПоказателиЗначениеПоказателяОтНасНачальныеПриИзмененииНаСервере(ТекСтр);
	
КонецПроцедуры
